#+TITLE: 2022 07 07_install Mattermost
#+PROPERTY: header-args: :comment no

* Background
On 4 July 2022, we attempted an upgrade to mattermost, going from 5.37 to 7.0.
We did this on our production environment, thinking it would be a simple change
in our mattermost manifest with an hour of downtime. There were errors in the
upgrade, and when we tried to downgrade back to 5.37, we were unable to connect
mattermost to the database. Our chat infrastructure was down, and it was unclear
how we would get it up.

The team moved to a temporary Slack workspace, and we(Caleb and Zach) opened a support
ticket with mattermost to see if they could diagnose the issue.  They asked us to
follow the deployment steps outlined in their docs and reply with a set of log files so
they could further help us.
* Goals
- Deploy mattermost at our previous version, following official documentation
- Migrate our backup data to this newly deployed mattermost
- Diagnose what the issue was in our migration with mattermost support
- Design a better deployment and upgrade pattern for ii to use with our infra.
* Deploy mattermost following official documentation
Our support rep gave us a [[https://docs.mattermost.com/install/install-kubernetes.html#rolling-upgrades][link for rolling upgrades]] for us to follow. Our last committed
version of mattermost, according to the ii/org repo, was 5.37 so our goal now is to follow
these instructions and get a working instance up at 5.37 with all our data.
** Install postgres operator
Mattermost's basic architecture is a server, database, and webclient.  We're using postgres
for the database, and mattermost has an official k8s operator to use with their postgres deployment.
This will essentially handle the day-to-day operating of the db.

We add the helm manifest repo, setup an operator.yaml, and then clone down the latest(at time of writing) official yaml
#+begin_src shell
helm repo add postgres-operator-charts https://opensource.zalando.com/postgres-operator/charts/postgres-operator
helm -n postgres-operator template --create-namespace postgres-operator postgres-operator-charts/postgres-operator > ./postgres-operator.yaml
curl -s -O -L https://github.com/zalando/postgres-operator/raw/v1.8.2/manifests/postgresql.crd.yaml
curl -s -O -L https://github.com/zalando/postgres-operator/raw/v1.8.2/manifests/operatorconfiguration.crd.yaml
#+end_src


With the necessary parts brought down, we apply it to our cluster.

#+begin_src shell
kubectl create namespace postgres-operator -o yaml --dry-run=client \
    | kubectl apply -f -
kubectl apply -f ./postgresql.crd.yaml -f ./operatorconfiguration.crd.yaml
kubectl apply -f ./postgres-operator.yaml
#+end_src

#+RESULTS:
#+begin_example
namespace/postgres-operator configured
customresourcedefinition.apiextensions.k8s.io/postgresqls.acid.zalan.do unchanged
customresourcedefinition.apiextensions.k8s.io/operatorconfigurations.acid.zalan.do unchanged
serviceaccount/postgres-operator created
clusterrole.rbac.authorization.k8s.io/postgres-pod created
clusterrole.rbac.authorization.k8s.io/postgres-operator created
clusterrolebinding.rbac.authorization.k8s.io/postgres-operator created
service/postgres-operator created
deployment.apps/postgres-operator created
operatorconfiguration.acid.zalan.do/postgres-operator created
#+end_example

Checking our new namespace, we see the operator pod is up and ready to go.
#+begin_src shell
kubectl -n postgres-operator get pods
#+end_src

#+RESULTS:
#+begin_example
NAME                                 READY   STATUS    RESTARTS   AGE
postgres-operator-64cc586c86-m6cww   1/1     Running   0          10s
#+end_example

Get the values for the chart
#+begin_src tmate
helm show values postgres-operator-charts/postgres-operator | less
#+end_src
** Create our working namespace
this is where all our applications will be running, e.g. mattermost and its database
#+begin_src shell
kubectl create namespace mattermost -o yaml --dry-run=client \
    | kubectl apply -f -
#+end_src

#+RESULTS:
#+begin_example
namespace/mattermost created
#+end_example

** Install postgres
We install the mattermost db from a k8s manifest.  We copied down
the existing manifest from our mattermost install and deployed that.
You can find the manifest in the [[*Mattermost DB manifest][appendix of this document.]]

Apply this yaml
#+begin_src shell
kubectl -n mattermost apply -f ./mattermost-postgresql.yaml
#+end_src

#+RESULTS:
#+begin_example
postgresql.acid.zalan.do/mattermost-db created
#+end_example

And validate that it is running

#+begin_src shell
kubectl -n mattermost get pods,postgresql,svc
#+end_src

#+RESULTS:
#+begin_example
NAME                                        READY   STATUS    RESTARTS   AGE
pod/mattermost-db-0                         1/1     Running   0          82s
pod/mattermost-db-1                         1/1     Running   0          71s
pod/mattermost-db-2                         1/1     Running   0          23s
pod/mattermost-db-pooler-79879bc8bf-5xr6l   1/1     Running   0          7s
pod/mattermost-db-pooler-79879bc8bf-t6f6v   1/1     Running   0          7s

NAME                                     TEAM         VERSION   PODS   VOLUME   CPU-REQUEST   MEMORY-REQUEST   AGE   STATUS
postgresql.acid.zalan.do/mattermost-db   mattermost   13        3      50Gi                                    83s   Running

NAME                           TYPE        CLUSTER-IP      EXTERNAL-IP   PORT(S)    AGE
service/mattermost-db          ClusterIP   10.110.59.194   <none>        5432/TCP   83s
service/mattermost-db-config   ClusterIP   None            <none>        <none>     74s
service/mattermost-db-pooler   ClusterIP   10.104.20.127   <none>        5432/TCP   7s
service/mattermost-db-repl     ClusterIP   10.100.196.12   <none>        5432/TCP   83s
#+end_example

** Install minio operator

Minio handles the object storage for our instance.  We'll use the official
operator manifest from mattermost.

#+begin_src shell
curl -s -O -L https://raw.githubusercontent.com/mattermost/mattermost-operator/v1.18.1/docs/minio-operator/minio-operator.yaml
#+end_src

create namespace and apply the yaml

#+begin_src shell
kubectl create namespace minio-operator -o yaml --dry-run=client \
    | kubectl apply -f -
kubectl -n minio-operator apply -f ./minio-operator.yaml
#+end_src

#+RESULTS:
#+begin_example
namespace/minio-operator created
customresourcedefinition.apiextensions.k8s.io/minioinstances.miniocontroller.min.io created
clusterrole.rbac.authorization.k8s.io/minio-operator-role created
serviceaccount/minio-operator-sa created
clusterrolebinding.rbac.authorization.k8s.io/minio-operator-binding created
deployment.apps/minio-operator created
#+end_example

Lastly, we validate the operator pod is up and working.
#+begin_src shell
kubectl -n minio-operator get pods
#+end_src

#+RESULTS:
#+begin_example
NAME                              READY   STATUS    RESTARTS   AGE
minio-operator-67c4c9cb88-bzkp7   1/1     Running   0          22s
#+end_example

** Install mattermost operators
For the mattermost server, we follow the same process as the other operators.
Use the official manifest:
#+begin_src shell :results silent
curl -s -O -L https://raw.githubusercontent.com/mattermost/mattermost-operator/v1.18.1/docs/mattermost-operator/mattermost-operator.yaml
#+end_src

Create a namespace and apply the manifest
#+begin_src shell
kubectl create ns mattermost-operator -o yaml --dry-run=client \
    | kubectl apply -f -
kubectl apply -n mattermost-operator -f ./mattermost-operator.yaml
#+end_src

#+RESULTS:
#+begin_example
namespace/mattermost-operator created
customresourcedefinition.apiextensions.k8s.io/clusterinstallations.mattermost.com created
customresourcedefinition.apiextensions.k8s.io/mattermostrestoredbs.mattermost.com created
customresourcedefinition.apiextensions.k8s.io/mattermosts.installation.mattermost.com created
serviceaccount/mattermost-operator created
clusterrole.rbac.authorization.k8s.io/mattermost-operator created
clusterrolebinding.rbac.authorization.k8s.io/mattermost-operator created
service/mattermost-operator created
deployment.apps/mattermost-operator created
#+end_example

Validate it's working.

#+begin_src shell
kubectl -n mattermost-operator get pods
#+end_src

#+RESULTS:
#+begin_example
NAME                                   READY   STATUS    RESTARTS   AGE
mattermost-operator-6b6c89cf5c-jzj5v   1/1     Running   0          19s
#+end_example

** Create local manifest file according to our needs

We are deploying this on a pair environment that has DNS, but we want to
make sure mattermost is using TLS and the correct domain.  So we are going to
create a certs.yaml and a mattermost.yaml and apply both.  Certs will handle TLS,
mattermost.yaml will handle the rest.

Both manifests can be found in our appendix:[[*Mattermost cert manifest][ cert.yaml]]  and [[*Mattermost server manifest][mattermost.yaml]]

** Create db secret
We create this secret to use as a password for our database, which
we then use to generate a db connection string.

Where are the existing generated secrets?
#+begin_src shell
kubectl -n mattermost get secret
#+end_src

#+RESULTS:
#+begin_example
NAME                                                            TYPE                                  DATA   AGE
default-token-rvffp                                             kubernetes.io/service-account-token   3      52m
mattermost-database                                             Opaque                                1      4m2s
mattermost.mattermost-db.credentials.postgresql.acid.zalan.do   Opaque                                2      51m
pooler.mattermost-db.credentials.postgresql.acid.zalan.do       Opaque                                2      51m
postgres-pod-token-wbqqb                                        kubernetes.io/service-account-token   3      51m
postgres.mattermost-db.credentials.postgresql.acid.zalan.do     Opaque                                2      51m
standby.mattermost-db.credentials.postgresql.acid.zalan.do      Opaque                                2      51m
#+end_example

Create a connection string using the generated password
#+begin_src shell
POSTGRES_PASSWORD="$(kubectl -n mattermost get secret mattermost.mattermost-db.credentials.postgresql.acid.zalan.do -o=jsonpath='{.data.password}' | base64 -d)"
kubectl -n mattermost create secret generic mattermost-database --from-literal=DB_CONNECTION_STRING="postgres://mattermost:$POSTGRES_PASSWORD@mattermost-db-pooler:5432/mattermost?sslmode=require" -o yaml --dry-run=client | \
    kubectl apply -f -
#+end_src

#+RESULTS:
#+begin_example
secret/mattermost-database configured
#+end_example

** Create user-config secret

Similar to the db connection string, we create secrets for the config env vars used in our [[*Mattermost server manifest][Mattermost server manifest]]
#+begin_src shell
kubectl -n mattermost create secret generic mattermost-user-config \
    --from-literal=MM_EMAILSETTINGS_ENABLESIGNINWITHUSERNAME="true" \
    --from-literal=MM_EMAILSETTINGS_ENABLESIGNINWITHEMAIL="true" \
    --from-literal=MM_EMAILSETTINGS_FEEDBACKNAME="mattermost.ii.coop" \
    --from-literal=MM_EMAILSETTINGS_SMTPUSERNAME="lmaolol" \
    --from-literal=MM_EMAILSETTINGS_SMTPPASSWORD="hahaha" \
    --from-literal=MM_EMAILSETTINGS_SMTPSERVER="smtp.gmail.com" \
    --from-literal=MM_EMAILSETTINGS_SMTPPORT="587" \
    --from-literal=MM_EMAILSETTINGS_CONNECTIONSECURITY="STARTTLS" \
    --dry-run=client \
    -o yaml | kubectl apply -f -
#+end_src


#+RESULTS:
#+begin_example
secret/mattermost-user-config created
#+end_example

You will see in the manifest that the value for the env vars points to k8s secrets.
** Install mattermost

With everything set up.and the files in our appendix tangled to this local dir, we can
apply the manifests and install mattermost.

#+begin_src shell
kubectl -n mattermost apply -f ./cert.yaml -f ./mattermost.yaml
#+end_src

#+RESULTS:
#+begin_example
certificate.cert-manager.io/letsencrypt-prod-mattermost unchanged
mattermost.installation.mattermost.com/mattermost created
#+end_example

Here we validate that everything is running as planned.

#+begin_src shell
kubectl -n mattermost get certs,challenges,mattermost,pods,ing
#+end_src

#+RESULTS:
#+begin_example
NAME                                                      READY   SECRET                                               AGE
certificate.cert-manager.io/letsencrypt-prod-mattermost   True    mattermost-zachmandeville-pair-sharing-io-tls-cert   85m

NAME                                                STATE    IMAGE                                      VERSION   ENDPOINT
mattermost.installation.mattermost.com/mattermost   stable   mattermost/mattermost-enterprise-edition   5.39      mattermost.zachmandeville.pair.sharing.io

NAME                                        READY   STATUS    RESTARTS   AGE
pod/mattermost-7f89fc46d4-5m22n             1/1     Running   0          61s
pod/mattermost-db-0                         1/1     Running   0          2m34s
pod/mattermost-db-1                         1/1     Running   0          2m23s
pod/mattermost-db-2                         1/1     Running   0          95s
pod/mattermost-db-pooler-79879bc8bf-5xr6l   1/1     Running   0          79s
pod/mattermost-db-pooler-79879bc8bf-t6f6v   1/1     Running   0          79s
pod/mattermost-minio-0                      1/1     Running   0          61s

NAME                                   CLASS    HOSTS                                       ADDRESS   PORTS     AGE
ingress.networking.k8s.io/mattermost   <none>   mattermost.zachmandeville.pair.sharing.io             80, 443   61s
#+end_example

* Migrate our Data to new deployment
When mattermost starts up, it creates the schema it needs and populates a
mattermost db in our postgres instance. To migrate our data, we want to drop
this existing db, then copy over our backup sql file created using pg_dump.

We logged into psql using our generated k8s secret
#+begin_example shell
export PGPASSWORD="$(kubectl -n mattermost get secret mattermost.mattermost-db.credentials.postgresql.acid.zalan.do -o=jsonpath='{.data.password}' | base64 -d)"
psql -U mattermost -h mattermost-db.mattermost -d postgres
#+end_example

Then, within this client, dropped and created a fresh mattermost db.
#+begin_example psql
#in psql
drop database mattermost with (force);
create database mattermost;
#+end_example

Our backup file was cloned down to a tmp folder, then loaded into the mattermost db
#+begin_example shell
psql -U mattermost -h mattermost-db.mattermost -d mattermost < /tmp/mattermost-db.sql
#+end_example

We were able to log in to psql and check the channels, users, and last public posts to see that the data matched what we expected and the
migration seemed to work.

* Try to log into new website and reply to support rep.
We deployed to mattermost.zachmandeville.pair.sharing.io, and since the db had our data,
we assumed we should be able to login.  Neither of us could log in, even after attempting to
change our passwords in the db.  We also found we coudln't use the mattermost cli to change our
password.  Either our deployment was missing something, or our database was missing something.
Either way, it felt we had enough to write back to the support rep.

We copied our config.json, mattermost.yaml, and last bit of logs from our mattermost pod and
attached it to a reply where we detailed this same progress and issue.
* Make suggested changes to our deployment
Our rep replied and said that our steps looked good and there was nothing they could see in our
manifests that would cause the issue.  They checked with their k8s team, and a k8s rep suggested
that if it didn't seem like we could connect to the database, then it might be that the mattermost server
is not using the right database connection string, and instead using a default one from the config.json

We followed their advice and [[*Mattermost server manifest][updated our manifest]] to allow us to use mmctl locally on the mattermost server and,
once it was up, issued this command to exec into the pod and set the right connection string.

#+begin_src shell
kubectl -n mattermost exec -ti deployments/mattermost -- mmctl --local config set SqlSettings.DataSource $MM_CONFIG
#+end_src

Returning to the webpage, we still could not log in.  We then tried to use mmctl to change our password.
* TODO Debug with mmctl
with mmctl, we should be able to change a users password, though we found that when we tried the command
#+begin_src shell
# this is run inside the mattermost server pod
mmctl --local users change-password zz --password <something new
#+end_src
it said the user was not found.  Even stranger, when we tried to list the users with

#+begin_src shell
# from mattermost-server pod
mmctl --local users list
#+end_src

it couldn't list any of the users at all. We decided to run the mattermost logs in a seperate tmux window while running this command.

When the command was run, this log appeared

#+begin_example json
{"level":"error","ts":1657590252.5781875,"caller":"mlog/log.go:251","msg":"We encountered an error while finding user profiles.","path":"/api/v4/users","request_id":"uzkcqw8bbjbt5esntjq
gq1g3qe","ip_addr":"","user_id":"","method":"GET","err_where":"GetUsersPage","http_code":500,"err_details":"failed to get User profiles: pq: column u.remoteid does not exist"}
{"level":"debug","ts":1657590252.5783038,"caller":"web/handlers.go:107","msg":"Received HTTP request","method":"GET","url":"/api/v4/users","request_id":"uzkcqw8bbjbt5esntjqgq1g3qe","hos
t":"_","scheme":"","status_code":"500"}
#+end_example

So it was connecting to the database, but it wasn't finding the database schema it was expecting.  We double checked our users column, by logging into the db directly, and there was no 'remoteid' column in this table.  We then looked into the mattermost source code and confirmed that when it ran GetUsersPage it was running a sql query that was asking for users.remoteid.  In other words, this version of mattermost is expecting a database schema we are not giving it.

We started to doubt whether 5.37 was our correct version.  Investigating the source code for the problem function, and traversing backwards through the tags,
we could see that u.remoteid was added in 5.35.  Is it possible we were actually on 5.34?

We then looked through the history of our previous deployment org file and could see that the last committed change before 5.37 was moving mattermost to 5.34.2
It looked like we might have committed a change to 5.37, but never actually deployed it.

The issue was not with the deployment, the db, or mattermost.  It was an org file/ii protocol issue, and we were trying to downgrade to a version we never
actually upgraded to.
* Redeploy using 5.34.2
We upgraded our mattermost.yaml to 5.34.2, tangled, then applied the manifest again.

#+begin_src shell
    kubectl -n mattermost apply -f ./cert.yaml -f ./mattermost.yaml
#+end_src

#+begin_src shell
kubectl -n mattermost get certs,challenges,mattermost,pods,ing
#+end_src

#+RESULTS:
#+begin_example
NAME                                                      READY   SECRET                                               AGE
certificate.cert-manager.io/letsencrypt-prod-mattermost   True    mattermost-zachmandeville-pair-sharing-io-tls-cert   4d23h

NAME                                                STATE    IMAGE                                      VERSION   ENDPOINT
mattermost.installation.mattermost.com/mattermost   stable   mattermost/mattermost-enterprise-edition   5.34.2    mattermost.zachmandeville.pair.sharing.io

NAME                                        READY   STATUS    RESTARTS   AGE
pod/mattermost-7dfcf4bf67-cw84b             1/1     Running   0          21s
pod/mattermost-db-0                         1/1     Running   0          61m
pod/mattermost-db-1                         1/1     Running   0          61m
pod/mattermost-db-2                         1/1     Running   0          60m
pod/mattermost-db-pooler-79879bc8bf-8bltf   1/1     Running   0          60m
pod/mattermost-db-pooler-79879bc8bf-mvs6q   1/1     Running   0          60m
pod/mattermost-minio-0                      1/1     Running   0          60m

NAME                                   CLASS    HOSTS                                       ADDRESS   PORTS     AGE
ingress.networking.k8s.io/mattermost   <none>   mattermost.zachmandeville.pair.sharing.io             80, 443   60m
#+end_example

* Log in successfully and chat with each other
After this deployment finished, both of us were able to log into mattermost, see the channels we expected and the last messages sent and talk to one another.
The deployment worked with 5.34.2!
* Appendix
** Mattermost DB manifest
#+NAME: Mattermost DB manifest
#+begin_src yaml :tangle ./mattermost-postgresql.yaml
apiVersion: "acid.zalan.do/v1"
kind: postgresql
metadata:
  name: mattermost-db
spec:
  enableConnectionPooler: true
  connectionPooler:
    mode: session
    resources:
      requests:
        cpu: 250m
        memory: 100Mi
      limits:
        cpu: "1"
        memory: 100Mi
  teamId: "mattermost"
  volume:
    size: 50Gi
  numberOfInstances: 3
  users:
    mattermost:  # database owner
    - superuser
    - createdb
  databases:
    mattermost: mattermost  # dbname: owner
  postgresql:
    version: "13"
#+end_src

** Mattermost cert manifest
#+NAME: cert.yaml
#+begin_src yaml :tangle ./cert.yaml
apiVersion: cert-manager.io/v1
kind: Certificate
metadata:
  name: letsencrypt-prod-mattermost
  namespace: mattermost
spec:
  secretName: mattermost-zachmandeville-pair-sharing-io-tls-cert
  issuerRef:
    name: letsencrypt-prod-http01
    kind: ClusterIssuer
    group: cert-manager.io
  dnsNames:
    - mattermost.zachmandeville.pair.sharing.io
#+end_src
** Mattermost server manifest
- Note taken on [2022-07-12 Tue 16:28] \\
  Switch version to 5.34.2
- Note taken on [2022-07-12 Tue 16:17] \\
  Add env MM_SERVICE_SETTINGS_ENABLELOCALMODE
#+NAME: mattermost.yaml
#+begin_src yaml :tangle ./mattermost.yaml
apiVersion: installation.mattermost.com/v1beta1
kind: Mattermost
metadata:
  name: mattermost
  namespace: mattermost
spec:
  database:
    external:
      secret: mattermost-database
  fileStore:
    operatorManaged:
      replicas: 1
      resources:
        requests:
          cpu: 150m
          memory: 512Mi
      storageSize: 50Gi
  image: mattermost/mattermost-enterprise-edition
  imagePullPolicy: IfNotPresent
  ingressName: mattermost.zachmandeville.pair.sharing.io
  useIngressTLS: true
  ingressAnnotations:
    kubernetes.io/ingress.class: contour-external
  replicas: 1
  scheduling:
    resources:
      limits:
        cpu: "2"
        memory: 4Gi
      requests:
        cpu: 150m
        memory: 256Mi
  version: "5.34.2"
  mattermostEnv:
    - name: MM_LOGSETTINGS_FILELEVEL
      value: "DEBUG"
    - name: MM_SERVICESETTINGS_ENABLELOCALMODE
      value: "TRUE"
    - name: MM_EMAILSETTINGS_ENABLESIGNINWITHEMAIL
      value: "true"
    - name: MM_EMAILSETTINGS_ENABLESIGNINWITHUSERNAME
      value: "true"
    - name: MM_EMAILSETTINGS_SENDEMAILNOTIFICATIONS
      value: "true"
    - name: MM_EMAILSETTINGS_REQUIREEMAILVERIFICATION
      value: "false"
    - name: MM_EMAILSETTINGS_FEEDBACKEMAIL
      value: "mattermost@ii.coop"
    - name: MM_EMAILSETTINGS_FEEDBACKORGANIZATION
      value: "ii.coop"
    - name: MM_EMAILSETTINGS_SENDEMAILNOTIFICATIONS
      value: "true"
    - name: MM_EMAILSETTINGS_SENDPUSHNOTIFICATIONS
      value: "true"
    - name: MM_EMAILSETTINGS_PUSHNOTIFICATIONSERVER
      value: "https://push-test.mattermost.com"
    - name: MM_EMAILSETTINGS_PUSHNOTIFICATIONCONTENTS
      value: "full"
    - name: MM_EMAILSETTINGS_ENABLESMTPAUTH
      value: "true"
    - name: MM_EMAILSETTINGS_ENABLESIGNINWITHEMAIL
      valueFrom:
        secretKeyRef:
          name: mattermost-user-config
          key: MM_EMAILSETTINGS_ENABLESIGNINWITHEMAIL
    - name: MM_EMAILSETTINGS_ENABLESIGNINWITHUSERNAME
      valueFrom:
        secretKeyRef:
          name: mattermost-user-config
          key: MM_EMAILSETTINGS_ENABLESIGNINWITHUSERNAME
    - name: MM_EMAILSETTINGS_FEEDBACKNAME
      valueFrom:
        secretKeyRef:
          name: mattermost-user-config
          key: MM_EMAILSETTINGS_FEEDBACKNAME
    - name: MM_EMAILSETTINGS_SMTPUSERNAME
      valueFrom:
        secretKeyRef:
          name: mattermost-user-config
          key: MM_EMAILSETTINGS_SMTPUSERNAME
    - name: MM_EMAILSETTINGS_SMTPPASSWORD
      valueFrom:
        secretKeyRef:
          name: mattermost-user-config
          key: MM_EMAILSETTINGS_SMTPPASSWORD
    - name: MM_EMAILSETTINGS_SMTPSERVER
      valueFrom:
        secretKeyRef:
          name: mattermost-user-config
          key: MM_EMAILSETTINGS_SMTPSERVER
    - name: MM_EMAILSETTINGS_SMTPPORT
      valueFrom:
        secretKeyRef:
          name: mattermost-user-config
          key: MM_EMAILSETTINGS_SMTPPORT
    - name: MM_EMAILSETTINGS_CONNECTIONSECURITY
      valueFrom:
        secretKeyRef:
          name: mattermost-user-config
          key: MM_EMAILSETTINGS_CONNECTIONSECURITY
#+end_src
** Tidy up scripts
quick scripts for when we need to bring everything down.  After this, you want to go through the
deployment steps in [[*Deploy mattermost following official documentation][* Deploy mattermost following official documentation]]
#+begin_src shell
kubectl -n mattermost delete -f ./mattermost.yaml -f ./mattermost-postgresql.yaml
kubectl -n mattermost delete persistentvolumeclaim/mattermost-minio-mattermost-minio-0
#+end_src

#+RESULTS:
#+begin_example
persistentvolumeclaim "mattermost-minio-mattermost-minio-0" deleted
#+end_example

View the progress
#+begin_src shell
kubectl -n mattermost get pods,pvc,secrets
#+end_src

#+RESULTS:
#+begin_example
NAME                                                        TYPE                                  DATA   AGE
secret/default-token-rvffp                                  kubernetes.io/service-account-token   3      141m
secret/mattermost-database                                  Opaque                                1      92m
secret/mattermost-user-config                               Opaque                                8      74m
secret/mattermost-zachmandeville-pair-sharing-io-tls-cert   kubernetes.io/tls                     2      77m
secret/postgres-pod-token-wbqqb                             kubernetes.io/service-account-token   3      140m
#+end_example
